Tekla Open API Reference for Tekla Structures 2025
TextFileAttributes Properties
The TextFile.TextFileAttributes type exposes the following members.
Properties
Name | Description
Font
 Gets or sets the font.
Frame
 Gets or sets the frame.
 (Inherited from EmbeddedObjectAttributes.)
Line
 Gets or sets the line type.
LineType |  Obsolete.
Scaling
 Gets or sets the scaling.
XScale
 Gets or sets the X scaling value. Changing this property will set the scaling type to ScaleXY.
 (Inherited from EmbeddedObjectAttributes.)
YScale
 Gets or sets the Y scaling value. Changing this property will set the scaling type to ScaleXY.
 (Inherited from EmbeddedObjectAttributes.)
Top
See Also
Reference
TextFile.TextFileAttributes Class
Tekla.Structures.Drawing Namespace